In [7]:
import open3d as o3d

pcd = o3d.io.read_point_cloud("finalfile.asc", format="xyz")
o3d.io.write_point_cloud("output2.pcd", pcd)

True

In [9]:
pcd=o3d.io.read_point_cloud("output2.pcd")

In [10]:
o3d.visualization.draw_geometries([pcd])

In [1]:
##############

In [13]:
reader

In [ ]:
## Convert into float

In [19]:
import pandas as pd

df=pd.read_csv("finaltext.txt", sep=" ", header=None)

In [20]:
df.head()

      0     1      2   3
0  2.72 -25.0  4.612 NaN
1  2.80 -25.0  4.538 NaN
2  2.88 -25.0  4.465 NaN
3  2.96 -25.0  4.385 NaN
4  3.04 -25.0  4.298 NaN

In [33]:
df=df.iloc[: , :-1]

In [34]:
df.to_csv("ali.csv",sep=" ", index=None)

In [35]:
df1=pd.read_csv("ali.csv", sep=" ")

In [37]:
df1

            0     1      2
0        2.72 -25.0  4.612
1        2.80 -25.0  4.538
2        2.88 -25.0  4.465
3        2.96 -25.0  4.385
4        3.04 -25.0  4.298
...       ...   ...    ...
193749  16.40  25.0 -5.571
193750  16.48  25.0 -5.627
193751  16.56  25.0 -5.696
193752  16.64  25.0 -5.741
193753  16.72  25.0 -5.797

[193754 rows x 3 columns]

In [45]:
def read_xyz(path_to_pc):
    X = []
    with open(path_to_pc) as f:
        reader = csv.reader(f, delimiter=' ')
        for row in reader:
            X.append(list(map(float, row)))
    return X

In [46]:
X_fix = np.array(read_xyz("ali.csv"))

In [48]:
X_fix[1:]

array([[  2.72 , -25.   ,   4.612],
       [  2.8  , -25.   ,   4.538],
       [  2.88 , -25.   ,   4.465],
       ...,
       [ 16.56 ,  25.   ,  -5.696],
       [ 16.64 ,  25.   ,  -5.741],
       [ 16.72 ,  25.   ,  -5.797]])